БухЭксп/Catalogs/CW_ВебПрофилиПеревозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВебПрофилиПеревозок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ВебПрофили</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПереводитьВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенВыводНаАнглийскомЯзыке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОсновногоОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаПереводаВАрхив</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрПереводаВАрхив</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеRU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеEN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТипФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноПрикреплятьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАрхива</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПрофиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебШаблоныПрофилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТипыФайлов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДоступныеПользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДоступныеПользователи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВебПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПользователиЛКК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПользователиВебПрофилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПользователиВебПрофилей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПользователиЛКК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВебПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофилиЗаявок</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофилиПеревозок</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Comment>"ГРУЗОПЕРЕВОЗКИ", "ЗАЯВКИ"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВебПользователиЛКК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВебПользователиЛКК</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьПечатныеФормы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентифкаторПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВебПрофилиПеревозок/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Наименование			= "Новый";
		Объект.ИдентификаторАрхива 	= Константы.CW_ПараметрПереводаГрузоперевозкиВАрхив.Получить();
	КонецЕсли;     

	ОбработатьИзменениеДоступностиАнглийскогоЯзыка();
	
	УстановитьАдресСхемыПараметров();	
	УстановитьАдресНастроекОтбора();
	
	ВидимостьТипыФайлов();

	ЗаполнитьСписокПользователей();
 	АвтоматическиПереводитьВАрхивПриИзмененииНаСервере();

КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОтборУстановлен = Ложь;
	НастройкиОтбора = ПолучитьИзВременногоХранилища(АдресНастроекОтбора);
	Если НастройкиОтбора <> Неопределено Тогда
		Для каждого ЭлементОтбора из НастройкиОтбора.Отбор.Элементы Цикл
			Если ЭлементОтбора.Использование Тогда
				ОтборУстановлен = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ОтборУстановлен Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не установлено ни одного отбора для профиля!",,,, Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ПредставлениеRU) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано представление профиля!",,"ПредставлениеRU","Объект", Отказ);
	КонецЕсли;
	
	Если Объект.ДоступенВыводНаАнглийскомЯзыке Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ПредставлениеEN) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано представление профиля на английском языке!",,"ПредставлениеRU","Объект", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресНастроекОтбора) Тогда
		ТекущийОбъект.НастройкиОсновногоОтбора = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресНастроекОтбора)); 
	КонецЕсли;  

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьСписокПользователейНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОЗаписиНового(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьАдресСхемыПараметров()
	
	СхемаДоступныхПолей  = ПолучитьОбщийМакет("CW_ГрузоперевозкиСхемаДоступныхПолей");
	АдресСхемыПараметров = ПоместитьВоВременноеХранилище(СхемаДоступныхПолей,Этаформа.УникальныйИдентификатор);
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьАдресНастроекОтбора()
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	НастройкиОсновногоОтбора	= ТОбъект.НастройкиОсновногоОтбора.Получить();
	АдресНастроекОтбора  		= ПоместитьВоВременноеХранилище(НастройкиОсновногоОтбора, УникальныйИдентификатор);
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСписокПользователей()
	
	мИдентифкаторыАктивныхПользователей = Справочники.CW_ВебПользователиЛКК.ПолучитьМассивИдентификаторовАктивныхПользователей();
	
	СписокПользователей.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоступныеПользователи.Пользователь КАК Пользователь,
	               |	CW_ДоступныеПользователи.Пользователь.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
	               |	НЕ CW_ДоступныеПользователи.Пользователь.ИдентифкаторПользователя = """" КАК ФлагЛК,
	               |	CW_ДоступныеПользователи.Пользователь.ИдентифкаторПользователя КАК ИдентифкаторПользователя
	               |ПОМЕСТИТЬ ВТ_ВсеПользователи
	               |ИЗ
	               |	РегистрСведений.CW_ДоступныеПользователи КАК CW_ДоступныеПользователи
	               |ГДЕ
	               |	CW_ДоступныеПользователи.Пользователь.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ДоступныеПользователи.ВебПрофиль = &Владелец
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА CW_ПользователиВебПрофилей.Пользователь ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Пометка,
	               |	ВТ_ВсеПользователи.Пользователь КАК Пользователь,
	               |	ВТ_ВсеПользователи.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
	               |	ВТ_ВсеПользователи.ФлагЛК КАК ФлагЛК,
	               |	ВЫБОР
	               |		КОГДА ВТ_ВсеПользователи.ИдентифкаторПользователя В (&мИдентифкаторыАктивныхПользователей)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Активный
	               |ИЗ
	               |	ВТ_ВсеПользователи КАК ВТ_ВсеПользователи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПользователиВебПрофилей КАК CW_ПользователиВебПрофилей
	               |		ПО (CW_ПользователиВебПрофилей.ВебПрофиль = &ВебПрофиль)
	               |			И ВТ_ВсеПользователи.Пользователь = CW_ПользователиВебПрофилей.Пользователь
	               |			И (CW_ПользователиВебПрофилей.Раздел = ""ГРУЗОПЕРЕВОЗКИ"")";
	
	Запрос.УстановитьПараметр("Владелец", 	Объект.Владелец);
	Запрос.УстановитьПараметр("ВебПрофиль", Объект.Ссылка);
	Запрос.УстановитьПараметр("мИдентифкаторыАктивныхПользователей",  мИдентифкаторыАктивныхПользователей);
	
	Выбрка = Запрос.Выполнить().Выбрать();
	Пока Выбрка.Следующий() Цикл
		НоваяСтрока = СписокПользователей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выбрка);
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПользователй(Команда)
	ЗаполнитьСписокПользователей();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтбора(Команда)
	
	Отказ = Истина;
	Если Объект.Ссылка.Пустая() Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ВопросПередНачаломНастроекОтбора", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Элемент справочника будет записан. Продлолжить?", Режим, 0);
	Иначе
		ПродолжитьОткрытиеФормыНастроекОтбора();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередНачаломНастроекОтбора(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	ПродолжитьОткрытиеФормыНастроекОтбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОткрытиеФормыНастроекОтбора()
	
	Модифицированность = Истина;

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияОтбораИСортировки",ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновки",	АдресСхемыПараметров);
	ПараметрыФормы.Вставить("АдресНастроек",	АдресНастроекОтбора);
	ПараметрыФормы.Вставить("ТекущийПрофиль",	Объект.Ссылка);
	
	ОткрытьФорму("Справочник.CW_ВебПрофилиПеревозок.Форма.НастройкаОтбора",ПараметрыФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияОтбораИСортировки(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		ТекущиеНастройкиОсновногоОтбора	= ПолучитьИзВременногоХранилища(Результат);
		АдресНастроекОтбора 			= ПоместитьВоВременноеХранилище(ТекущиеНастройкиОсновногоОтбора, УникальныйИдентификатор);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПользователейНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПользователиВебПрофилей.Пользователь КАК Пользователь,
	               |	CW_ПользователиВебПрофилей.ВебПрофиль КАК ВебПрофиль,
	               |	CW_ПользователиВебПрофилей.Основной КАК Основной
	               |ИЗ
	               |	РегистрСведений.CW_ПользователиВебПрофилей КАК CW_ПользователиВебПрофилей
	               |ГДЕ
	               |	CW_ПользователиВебПрофилей.Раздел = ""ГРУЗОПЕРЕВОЗКИ""
				   |	И CW_ПользователиВебПрофилей.ВебПрофиль = &ВебПрофиль
	               |	И CW_ПользователиВебПрофилей.Основной = ИСТИНА";
	
	Запрос.УстановитьПараметр("ВебПрофиль", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивОсновнойПользовательПрофиля = новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивОсновнойПользовательПрофиля.Добавить(Выборка.Пользователь);	
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.CW_ПользователиВебПрофилей.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Раздел.Установить("ГРУЗОПЕРЕВОЗКИ");
	НаборЗаписей.Отбор.ВебПрофиль.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого СтрокаПользователей из СписокПользователей Цикл
		Если НЕ СтрокаПользователей.Пометка Тогда
			Продолжить;
		КонецЕсли;
		ЗаписьНабора = НаборЗаписей.Добавить();   
		ЗаписьНабора.ОсновнойПрофиль 	= Объект.Владелец;
		ЗаписьНабора.ВебПрофиль 		= Объект.Ссылка;
		ЗаписьНабора.Раздел 			= "ГРУЗОПЕРЕВОЗКИ";
		ЗаписьНабора.Пользователь 		= СтрокаПользователей.Пользователь;
		ЗаписьНабора.Основной			= МассивОсновнойПользовательПрофиля.Найти(СтрокаПользователей.Пользователь) <> Неопределено;
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры

&НаСервере
Процедура ВидимостьТипыФайлов()
	
	Элементы.ГруппаТипыВыгружаемыхФайлов.Доступность 	= Объект.ВыгружатьФайлы; 
	Элементы.ВыводитьТипФайла.Доступность 				= Объект.ВыгружатьФайлы;   
	Элементы.РазрешеноПрикреплятьФайлы.Доступность 		= Объект.ВыгружатьФайлы;   
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьФайлыПриИзменении(Элемент)
	
	Если НЕ Объект.ВыгружатьФайлы Тогда
		Объект.ТипыФайлов.Очистить();  
		Объект.ВыводитьТипФайла = Ложь;
		Объект.РазрешеноПрикреплятьФайлы = Ложь;
	КонецЕсли;    
	
	ВидимостьТипыФайлов();
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическиПереводитьВАрхивПриИзменении(Элемент)
	
	АвтоматическиПереводитьВАрхивПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура АвтоматическиПереводитьВАрхивПриИзмененииНаСервере()
	
	Элементы.Группа7.Видимость = Объект.АвтоматическиПереводитьВАрхив;  
		
	// при отсутствии прав на команду элемент будет недоступен 
	Попытка
		Элементы.ПеревестиВАрхивВыранныеВебПрофили.Видимость 	= Объект.АвтоматическиПереводитьВАрхив;
	Исключение
	КонецПопытки;
	
	Если НЕ Объект.АвтоматическиПереводитьВАрхив Тогда
		Объект.ПараметрПереводаВАрхив = Неопределено;
		Объект.ОтсрочкаПереводаВАрхив = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПараметрПереводаВАрхивНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	МассивДоступныхПараметров =  ПолучитьСписокДоступныхПараметров(Тип("Дата"));
	
	Если МассивДоступныхПараметров.Количество() > 0 Тогда
		СтруктураОтбора = Новый Структура("Ссылка", МассивДоступныхПараметров);
		ПараметрыФормыВыбора = Новый Структура("Отбор", СтруктураОтбора);
		
		ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора", ПараметрыФормыВыбора, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиСнятьПометки(Команда)
	ОбработатьФлажкиСписка(ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПользователиУстановитьПометки(Команда)
	ОбработатьФлажкиСписка(Истина);
КонецПроцедуры

&НаСервере
Процедура ОбработатьФлажкиСписка(Флаг)
	
	Для Каждого СтрокаПользователей из СписокПользователей Цикл
		СтрокаПользователей.Пометка = Флаг;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступенВыводНаАнглийскомЯзыкеПриИзменении(Элемент)
	
	ОбработатьИзменениеДоступностиАнглийскогоЯзыка();
	
КонецПроцедуры  

&НаСервере
Процедура ОбработатьИзменениеДоступностиАнглийскогоЯзыка()
	
	Элементы.ПредставлениеRU.КнопкаВыбора = Объект.ДоступенВыводНаАнглийскомЯзыке;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторАрхивныхГрузоперевозокНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;                         
	
	МассивПараметров =  ПолучитьСписокДоступныхПараметров(Тип("Булево"));  
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ссылка", МассивПараметров);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МножественныйВыбор", Ложь);
	СтруктураПараметров.Вставить("ЗакрыватьприВыборе", истина);
	СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора", СтруктураПараметров, Элемент);

КонецПроцедуры     

&НаСервере
Функция ПолучитьСписокДоступныхПараметров(Тип)
	
	МассивПараметров = Новый Массив;
	ВсеДоступныепараметры 	= ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучитьСписокПараметровПоТипуЗначения(Тип); 
	Возврат ВсеДоступныепараметры;   
	
	//УДАЛЕНО по заявке №AFR-240308 от 23.07.2024
	//ТаблицаСтруктураПрофиля = Объект.ШаблонПрофиля.СтруктураПрофиля.Выгрузить();  
	//
	//Для Каждого СтрокаТаблицы из ТаблицаСтруктураПрофиля Цикл
	//	Если ВсеДоступныепараметры.Найти(СтрокаТаблицы.ОбъектХарактеристики) <> Неопределено Тогда
	//		МассивПараметров.Добавить(СтрокаТаблицы.ОбъектХарактеристики);	
	//	КонецЕсли;
	//КонецЦикла;  
	//
	//Возврат МассивПараметров;
	//---УДАЛЕНО по заявке №AFR-240308 от 23.07.2024
	
КонецФункции

&НаКлиенте
Процедура ПредставлениеRUНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = ложь;
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("RU", Объект.ПредставлениеRU);
	СтруктураПараметров.Вставить("EN", Объект.ПредставлениеEN); 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Реквизит", "Представление");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаврешитьВводТекстаНаРазныхЯзыках", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВводаТекстаНаРазныхЯзыках", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаврешитьВводТекстаНаРазныхЯзыках(РезультатВвода, ДополнительныеПараметры) Экспорт
	
	Если РезультатВвода = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаврешитьЗаврешитьВводТекстаНаРазныхЯзыкахНаСервере(РезультатВвода, ДополнительныеПараметры.Реквизит);

	Модифицированность = истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаврешитьЗаврешитьВводТекстаНаРазныхЯзыкахНаСервере(РезультатВвода, ИмяРеквизита)
	
	Для Каждого КлючЗначение из РезультатВвода Цикл
		Объект[ИмяРеквизита + КлючЗначение.Ключ] = КлючЗначение.Значение; 
	КонецЦикла;    
	
КонецПроцедуры
